Masmiseim36/nxpSDK/devices/MIMXRT117H/drivers/fsl_clock.h
    /* M4 */
    kCLOCK_M4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_M4_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_M4_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_M4_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_M4_ClockRoot_MuxSysPll3Pfd3  = 4U,
    kCLOCK_M4_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_M4_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_M4_ClockRoot_MuxSysPll1Div5  = 7U,

    /* BUS */
    kCLOCK_BUS_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_BUS_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_BUS_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_BUS_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_BUS_ClockRoot_MuxSysPll3Out   = 4U,
    kCLOCK_BUS_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_BUS_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_BUS_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* BUS_LPSR */
    kCLOCK_BUS_LPSR_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxSysPll3Pfd3  = 4U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_BUS_LPSR_ClockRoot_MuxSysPll1Div5  = 7U,

    /* SEMC */
    kCLOCK_SEMC_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SEMC_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SEMC_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SEMC_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SEMC_ClockRoot_MuxSysPll1Div5  = 4U,
    kCLOCK_SEMC_ClockRoot_MuxSysPll2Out   = 5U,
    kCLOCK_SEMC_ClockRoot_MuxSysPll2Pfd1  = 6U,
    kCLOCK_SEMC_ClockRoot_MuxSysPll3Pfd0  = 7U,

    /* CSSYS */
    kCLOCK_CSSYS_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSSYS_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSSYS_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSSYS_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSSYS_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_CSSYS_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_CSSYS_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_CSSYS_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* CSTRACE */
    kCLOCK_CSTRACE_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSTRACE_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSTRACE_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSTRACE_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSTRACE_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_CSTRACE_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_CSTRACE_ClockRoot_MuxSysPll2Pfd1  = 6U,
    kCLOCK_CSTRACE_ClockRoot_MuxSysPll2Out   = 7U,

    /* M4_SYSTICK */
    kCLOCK_M4_SYSTICK_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxSysPll3Pfd3  = 4U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxSysPll2Pfd0  = 6U,
    kCLOCK_M4_SYSTICK_ClockRoot_MuxSysPll1Div5  = 7U,

    /* M7_SYSTICK */
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxSysPll3Div2  = 5U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_M7_SYSTICK_ClockRoot_MuxSysPll2Pfd0  = 7U,

    /* ADC1 */
    kCLOCK_ADC1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ADC1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ADC1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ADC1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ADC1_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_ADC1_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_ADC1_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_ADC1_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* ADC2 */
    kCLOCK_ADC2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ADC2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ADC2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ADC2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ADC2_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_ADC2_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_ADC2_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_ADC2_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* ACMP */
    kCLOCK_ACMP_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ACMP_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ACMP_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ACMP_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ACMP_ClockRoot_MuxSysPll3Out   = 4U,
    kCLOCK_ACMP_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_ACMP_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_ACMP_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* FLEXIO1 */
    kCLOCK_FLEXIO1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_FLEXIO1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_FLEXIO1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_FLEXIO1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* FLEXIO2 */
    kCLOCK_FLEXIO2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_FLEXIO2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_FLEXIO2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_FLEXIO2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* GPT1 */
    kCLOCK_GPT1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_GPT1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_GPT1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_GPT1_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_GPT1_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_GPT1_ClockRoot_MuxSysPll3Pfd2  = 6U,
    kCLOCK_GPT1_ClockRoot_MuxSysPll3Pfd3  = 7U,

    /* GPT2 */
    kCLOCK_GPT2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_GPT2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_GPT2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_GPT2_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_GPT2_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_GPT2_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_GPT2_ClockRoot_MuxVideoPllOut  = 7U,

    /* GPT3 */
    kCLOCK_GPT3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT3_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_GPT3_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_GPT3_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_GPT3_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_GPT3_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_GPT3_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_GPT3_ClockRoot_MuxVideoPllOut  = 7U,

