Masmiseim36/nxpSDK/devices/MIMXRT117H/drivers/fsl_clock.h
    /* EMV2 */
    kCLOCK_EMV2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_EMV2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_EMV2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_EMV2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_EMV2_ClockRoot_MuxSysPll3Div2  = 4U,
    kCLOCK_EMV2_ClockRoot_MuxSysPll1Div5  = 5U,
    kCLOCK_EMV2_ClockRoot_MuxSysPll2Out   = 6U,
    kCLOCK_EMV2_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* ENET1 */
    kCLOCK_ENET1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET1_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET1_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET1_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET1_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET2 */
    kCLOCK_ENET2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET2_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET2_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET2_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET2_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET_QOS */
    kCLOCK_ENET_QOS_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET_QOS_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET_QOS_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET_QOS_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET_QOS_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET_QOS_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET_QOS_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET_QOS_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET_25M */
    kCLOCK_ENET_25M_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET_25M_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET_25M_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET_25M_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET_25M_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET_25M_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET_25M_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET_25M_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET_TIMER1 */
    kCLOCK_ENET_TIMER1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET_TIMER1_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET_TIMER2 */
    kCLOCK_ENET_TIMER2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET_TIMER2_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* ENET_TIMER3 */
    kCLOCK_ENET_TIMER3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxSysPll1Div2  = 4U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxAudioPllOut  = 5U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_ENET_TIMER3_ClockRoot_MuxSysPll2Pfd1  = 7U,

    /* USDHC1 */
    kCLOCK_USDHC1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_USDHC1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_USDHC1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_USDHC1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_USDHC1_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_USDHC1_ClockRoot_MuxSysPll2Pfd0  = 5U,
    kCLOCK_USDHC1_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_USDHC1_ClockRoot_MuxArmPllOut    = 7U,

    /* USDHC2 */
    kCLOCK_USDHC2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_USDHC2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_USDHC2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_USDHC2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_USDHC2_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_USDHC2_ClockRoot_MuxSysPll2Pfd0  = 5U,
    kCLOCK_USDHC2_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_USDHC2_ClockRoot_MuxArmPllOut    = 7U,

    /* ASRC */
    kCLOCK_ASRC_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_ASRC_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_ASRC_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_ASRC_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_ASRC_ClockRoot_MuxSysPll1Div5  = 4U,
    kCLOCK_ASRC_ClockRoot_MuxSysPll3Div2  = 5U,
    kCLOCK_ASRC_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_ASRC_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* MQS */
    kCLOCK_MQS_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_MQS_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_MQS_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_MQS_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_MQS_ClockRoot_MuxSysPll1Div5  = 4U,
    kCLOCK_MQS_ClockRoot_MuxSysPll3Div2  = 5U,
    kCLOCK_MQS_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_MQS_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* MIC */
    kCLOCK_MIC_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_MIC_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_MIC_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_MIC_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_MIC_ClockRoot_MuxSysPll3Pfd3  = 4U,
    kCLOCK_MIC_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_MIC_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_MIC_ClockRoot_MuxSysPll1Div5  = 7U,

    /* SPDIF */
    kCLOCK_SPDIF_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SPDIF_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SPDIF_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SPDIF_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SPDIF_ClockRoot_MuxAudioPllOut  = 4U,
    kCLOCK_SPDIF_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_SPDIF_ClockRoot_MuxSysPll3Pfd2  = 6U,
    kCLOCK_SPDIF_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* SAI1 */
    kCLOCK_SAI1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SAI1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SAI1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SAI1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SAI1_ClockRoot_MuxAudioPllOut  = 4U,
    kCLOCK_SAI1_ClockRoot_MuxSysPll3Pfd2  = 5U,
    kCLOCK_SAI1_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_SAI1_ClockRoot_MuxSysPll2Pfd3  = 7U,

