Masmiseim36/nxpSDK/devices/MIMXRT117H/drivers/fsl_clock.h
    /* SAI2 */
    kCLOCK_SAI2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SAI2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SAI2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SAI2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SAI2_ClockRoot_MuxAudioPllOut  = 4U,
    kCLOCK_SAI2_ClockRoot_MuxSysPll3Pfd2  = 5U,
    kCLOCK_SAI2_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_SAI2_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* SAI3 */
    kCLOCK_SAI3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SAI3_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SAI3_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SAI3_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SAI3_ClockRoot_MuxAudioPllOut  = 4U,
    kCLOCK_SAI3_ClockRoot_MuxSysPll3Pfd2  = 5U,
    kCLOCK_SAI3_ClockRoot_MuxSysPll1Div5  = 6U,
    kCLOCK_SAI3_ClockRoot_MuxSysPll2Pfd3  = 7U,

    /* SAI4 */
    kCLOCK_SAI4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_SAI4_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_SAI4_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_SAI4_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_SAI4_ClockRoot_MuxSysPll3Pfd3  = 4U,
    kCLOCK_SAI4_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_SAI4_ClockRoot_MuxAudioPllOut  = 6U,
    kCLOCK_SAI4_ClockRoot_MuxSysPll1Div5  = 7U,

    /* GC355 */
    kCLOCK_GC355_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GC355_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_GC355_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_GC355_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_GC355_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_GC355_ClockRoot_MuxSysPll2Pfd1  = 5U,
    kCLOCK_GC355_ClockRoot_MuxSysPll3Out   = 6U,
    kCLOCK_GC355_ClockRoot_MuxVideoPllOut  = 7U,

    /* LCDIF */
    kCLOCK_LCDIF_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LCDIF_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_LCDIF_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_LCDIF_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_LCDIF_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_LCDIF_ClockRoot_MuxSysPll2Pfd2  = 5U,
    kCLOCK_LCDIF_ClockRoot_MuxSysPll3Pfd0  = 6U,
    kCLOCK_LCDIF_ClockRoot_MuxVideoPllOut  = 7U,

    /* LCDIFV2 */
    kCLOCK_LCDIFV2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LCDIFV2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_LCDIFV2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_LCDIFV2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_LCDIFV2_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_LCDIFV2_ClockRoot_MuxSysPll2Pfd2  = 5U,
    kCLOCK_LCDIFV2_ClockRoot_MuxSysPll3Pfd0  = 6U,
    kCLOCK_LCDIFV2_ClockRoot_MuxVideoPllOut  = 7U,

    /* MIPI_REF */
    kCLOCK_MIPI_REF_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_MIPI_REF_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_MIPI_REF_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_MIPI_REF_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_MIPI_REF_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_MIPI_REF_ClockRoot_MuxSysPll2Pfd0  = 5U,
    kCLOCK_MIPI_REF_ClockRoot_MuxSysPll3Pfd0  = 6U,
    kCLOCK_MIPI_REF_ClockRoot_MuxVideoPllOut  = 7U,

    /* MIPI_ESC */
    kCLOCK_MIPI_ESC_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxSysPll2Out   = 4U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxSysPll2Pfd0  = 5U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxSysPll3Pfd0  = 6U,
    kCLOCK_MIPI_ESC_ClockRoot_MuxVideoPllOut  = 7U,

    /* CSI2 */
    kCLOCK_CSI2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSI2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSI2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSI2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSI2_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_CSI2_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_CSI2_ClockRoot_MuxSysPll2Pfd0  = 6U,
    kCLOCK_CSI2_ClockRoot_MuxVideoPllOut  = 7U,

    /* CSI2_ESC */
    kCLOCK_CSI2_ESC_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxSysPll2Pfd0  = 6U,
    kCLOCK_CSI2_ESC_ClockRoot_MuxVideoPllOut  = 7U,

    /* CSI2_UI */
    kCLOCK_CSI2_UI_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSI2_UI_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSI2_UI_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSI2_UI_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSI2_UI_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_CSI2_UI_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_CSI2_UI_ClockRoot_MuxSysPll2Pfd0  = 6U,
    kCLOCK_CSI2_UI_ClockRoot_MuxVideoPllOut  = 7U,

    /* CSI */
    kCLOCK_CSI_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CSI_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CSI_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CSI_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CSI_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_CSI_ClockRoot_MuxSysPll3Out   = 5U,
    kCLOCK_CSI_ClockRoot_MuxSysPll3Pfd1  = 6U,
    kCLOCK_CSI_ClockRoot_MuxVideoPllOut  = 7U,

    /* CKO1 */
    kCLOCK_CKO1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CKO1_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CKO1_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CKO1_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CKO1_ClockRoot_MuxSysPll2Pfd2  = 4U,
    kCLOCK_CKO1_ClockRoot_MuxSysPll2Out   = 5U,
    kCLOCK_CKO1_ClockRoot_MuxSysPll3Pfd1  = 6U,
    kCLOCK_CKO1_ClockRoot_MuxSysPll1Div5  = 7U,

    /* CKO2 */
    kCLOCK_CKO2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CKO2_ClockRoot_MuxOsc24MOut    = 1U,
    kCLOCK_CKO2_ClockRoot_MuxOscRc400M    = 2U,
    kCLOCK_CKO2_ClockRoot_MuxOscRc16M     = 3U,
    kCLOCK_CKO2_ClockRoot_MuxSysPll2Pfd3  = 4U,
    kCLOCK_CKO2_ClockRoot_MuxOscRc48M     = 5U,
    kCLOCK_CKO2_ClockRoot_MuxSysPll3Pfd1  = 6U,
    kCLOCK_CKO2_ClockRoot_MuxAudioPllOut  = 7U,
} clock_root_mux_source_t;

typedef enum _clock_group
{
    kCLOCK_Group_FlexRAM = 0,
    kCLOCK_Group_MipiDsi = 1,
    kCLOCK_Group_Last,
} clock_group_t;

typedef struct _clock_group_config
{
    bool clockOff;     /*!< Turn off the clock. */
    uint16_t resetDiv; /*!< resetDiv + 1 should be common multiple of all dividers, valid range 0 ~ 255. */
    uint8_t div0;      /*!< Divide root clock by div0 + 1, valid range: 0 ~ 15. */
} clock_group_config_t;

